/*Напишите программу, которая задаёт массив из 8 элементов и выводит их на экран.
 
 1, 2, 5, 7, 19 -> [1, 2, 5, 7, 19]

 6, 1, 33 -> [6, 1, 33]*/
int[] x = new int[8];
int i = 0;
Console.WriteLine(x[i]);
